resources/testData.json

{
    "payments": {
        "insertTestPayment": {
            "title": "test payment",
            "description": "test description",
            "amount": "20",
            "currency": "PMA",
            "startTimestamp": "1234566899",
            "endTimestamp": "9876543211",
            "limit": 5,
            "type": 1,
            "frequency": 3,
            "merchantAddress": "string"
        },
        "updateTestPayment": {
            "id": "",
            "title": "changes title",
            "description": "another description",
            "promo": "testing",
            "status": 2,
            "customerAddress": "0xuiuin2n",
            "amount": "20",
            "currency": "CVC",
            "startTimestamp": "987654321",
            "endTimestamp": "123456789",
            "limit": 5,
            "nextPaymentDate": "123456789",
            "lastPaymentDate": "123456789",
            "type": 2,
            "frequency": 3,
            "registerTxHash": "string",
            "registerTxStatus": 1,
            "executeTxHash": "string",
            "executeTxStatus": 1,
            "debitAccount": "string",
            "merchantAddress": "string"
        }
    }
}